# 1) ხელით შეავსეთ 5-ელემენტიანი მთელი რიცხვების მასივი და გამობეჭდეთ მე-2 და მე-4 ინდექსზე მყოფი ელემენტები.
arr=[1,2,3,4,5]
print(arr[2],arr[4])
# 2) შემოგდით ჯერ N - შესატანი რიცხვების რაოდენობა, შემდეგ კი N ცალი რიცხვი. შეავსეთ მასივი
#  (0 დან) შეყვანილი რიცხვებით და გამობეჭდეთ კენტ ინდექსზე მყოფი ელემენტები ( a[1], a[3], a[5]...)
# პირობა ვერ გავიგე

# 3) აღწერეთ 10 ელემენტიანი მთელი რიცხვების მასივი,
#  შეიყვანეთ კონსოლიდან 10 ელემენტი (for-ით), მასივში არსებული რიცხვები გააორმაგეთ და გამობეჭდეთ ეკრანზე
arr=[]
for i in range(10):
    x=int(input())
    arr.append(x*2)
    print(arr)

# 4) შემოგდით ჯერ N - შესატანი რიცხვების რაოდენობა, შემდეგ კი N ცალი რიცხვი.
#  შეინახეთ რიცხვები მასივში და გამობეჭდეთ შებრუნებული თანმიმდევრობით. 
# (მაგ: თუ რიცხვებია 5 7 12, გამობეჭდეთ 12, 7, 5)
def print_reverse(arr):
    for i in range(len(arr) - 1, -1, -1):
        print(arr[i],end=" ")
print_reverse([1,5,2,6])
